app/controllers/quads_controller.rb

SELECT "quads".* FROM "quads"
---
  def index
    @all_quads = Quad.all