app/controllers/users_controller.rb

  def create
    if(params[:password_confirmation] == params[:password])
      @user = User.new(user_params)
      respond_to do |format|
        if @user.save
---
INSERT INTO "users" ("user_name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "jmaeda2"], ["password", "lolol"], ["email", "email@gmail.com"], ["created_at", "2016-02-28 23:15:52.475878"], ["updated_at", "2016-02-28 23:15:52.475878"]]